# list

my_list = ("nika", "luka")

# 1  მრავალფეროვნება
# 2  შედეგიანობა
# 3  შეფარდების სიჩქარე
# 4  ინვექცია და შემადგენლობა
# 5  ინვექციის უნარი
# 6  ფუნქციები და მეთოდები
# 7  ინდექსირება
# 8  სიგრძე
# 9  განლაგება
# 10  ჩამატება და ბრუნვა
# 11 მოწვდვა

# turple

my_turple = ("nika" "luka")

# 1  მრავალფეროვნება
# 2  არადროშიანობა
# 3  ინდექსირება
# 4  სიგრძე
# 5  შეფარდების სიჩქარე
# 6  განლაგება
# 7  ფუნქციები და მეთოდები
# 8  სისწრაფე
# 9  გამოყენება
# 10 ჩამატება
# 11 ჩამატება და ბრუნვა

# set

my_set = {1, 2, 3, 3}

# 1  უნიკალურობა
# 2  არასავალდებულო წესრიგი
# 3  შეცვლადობა
# 4  ფუნქციები და მეთოდები
# 5  ალგებრული ოპერაციები
# 6  მოწვდვა
# 7  პირველადი მონაცემთა ტიპები
# 8  მოწვდვის სიჩქარე 
# 9  გამოყენება

# list da turple 

# msgavsebebi aris

# მრავალფეროვნება
# ინდექსირება
# არასავალდებულო წესრიგი
# თვალყურის დევნა

# gansxvaveba

# შეცვლადობა
# შექმნის სიჩქარე
# მოწვდვის სიჩქარე
# გამოყენების შემთხვევები
# შენახვის მეხსიერება

# list da set

# msgavsebi

# მრავალფეროვნება
# ელემენტების სია

# gansxvavebebi

# უნიკალურობა
# შეცვლადობა
# წესრიგი
# შექმნის სიჩქარე
# ფუნქციები და მეთოდები
# გამოყენების შემთხვევები

# 4 

# msgavsebi

# მრავალფეროვნება
# მონაცემების ჯგუფირება
# ინდექსირება
# მოწვდვა
 
# gansxvavebebi

# უნიკალურობა
# შეცვლადობა
# წესრიგი
# შექმნის სიჩქარე
# ფუნქციები
# გამოყენების შემთხვევები


# fruits = {"apple", "orange", "banana"}

# fruits.add("watermelon")

# print(fruits)

# fruits = {"apple", "orange", "banana"}

# fruits.remove("orange")

# print(fruits)